In [2]:
import numpy as np
import pandas as pd

In [6]:
# Pandas --> Series and Dataframes

In [8]:
# Series - 1d array that can contain different datatypes!

In [10]:
myseries = pd.Series([1,"Hey",2,"Upgrad"])
myseries

0         1
1       Hey
2         2
3    Upgrad
dtype: object

In [12]:
# index | Table like structure | datatype!

In [14]:
myseries[0]

1

In [16]:
myseries[3]

'Upgrad'

In [18]:
data = {
  "calories": [420, 380, 390,300,120,100,677,888,200,100],
  "duration": [50, 40, 45,30,54,87,55,20,34,56]
}

In [20]:
type(data)

dict

In [22]:
data.keys()

dict_keys(['calories', 'duration'])

In [24]:
data.values()

dict_values([[420, 380, 390, 300, 120, 100, 677, 888, 200, 100], [50, 40, 45, 30, 54, 87, 55, 20, 34, 56]])

In [26]:
data.items()

dict_items([('calories', [420, 380, 390, 300, 120, 100, 677, 888, 200, 100]), ('duration', [50, 40, 45, 30, 54, 87, 55, 20, 34, 56])])

In [30]:
df = pd.DataFrame(data)
df 
# indexes are added by default

   calories  duration
0       420        50
1       380        40
2       390        45
3       300        30
4       120        54
5       100        87
6       677        55
7       888        20
8       200        34
9       100        56

In [32]:
df.shape #rows,column

(10, 2)

In [36]:
df.columns #column names

Index(['calories', 'duration'], dtype='object')

In [38]:
df.head() #by default : first 5 rows of the data!

   calories  duration
0       420        50
1       380        40
2       390        45
3       300        30
4       120        54

In [40]:
df.head(2)

   calories  duration
0       420        50
1       380        40

In [42]:
df.tail() # default : last 5 rows of the data

   calories  duration
5       100        87
6       677        55
7       888        20
8       200        34
9       100        56

In [44]:
df.tail(2)

   calories  duration
8       200        34
9       100        56

In [48]:
df.head()

   calories  duration
0       420        50
1       380        40
2       390        45
3       300        30
4       120        54

In [50]:
df.info() # general information about the dataframe!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  10 non-null     int64
 1   duration  10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

In [52]:
df.describe() #statistical features of numerical columns

         calories   duration
count   10.000000  10.000000
mean   357.500000  47.100000
std    259.510329  18.387496
min    100.000000  20.000000
25%    140.000000  35.500000
50%    340.000000  47.500000
75%    412.500000  54.750000
max    888.000000  87.000000

In [54]:
# What is a transpose?
# converting rows to columns & columns to rows

In [60]:
df_t = df.describe().T
df_t

          count   mean         std    min    25%    50%     75%    max
calories   10.0  357.5  259.510329  100.0  140.0  340.0  412.50  888.0
duration   10.0   47.1   18.387496   20.0   35.5   47.5   54.75   87.0

In [62]:
# python - NaN (not a number)

In [64]:
df

   calories  duration
0       420        50
1       380        40
2       390        45
3       300        30
4       120        54
5       100        87
6       677        55
7       888        20
8       200        34
9       100        56

In [66]:
df.isnull().sum() # column wise sum of missing values

calories    0
duration    0
dtype: int64

In [70]:
# df.isnull()

In [82]:
data = {'A': [1, 2, 2, 3, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50]}
df = pd.DataFrame(data)
df

   A   B
0  1  10
1  2  20
2  2  20
3  3  30
4  4  40
5  4  40
6  5  50

In [86]:
# df.drop_duplicates()
df.drop_duplicates(ignore_index=True)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [88]:
# 2 ways to save this :
# i. df = df.drop_duplicates(ignore_index=True)

# ii. 
df.drop_duplicates(ignore_index=True,inplace=True)
# inplace=True modifies the DataFrame directly without creating a new copy.

In [90]:
df.head()

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [92]:
data = {'Name': ["upgrad", "Krishna","Krishna", "Irfan","Irfan"]}
df = pd.DataFrame(data)
df

      Name
0   upgrad
1  Krishna
2  Krishna
3    Irfan
4    Irfan

In [94]:
df['Name'].nunique()
# number of unique values in the name column

3

In [96]:
df['Name'].unique()
# unique values in the name column

array(['upgrad', 'Krishna', 'Irfan'], dtype=object)

In [98]:
df['Name'].value_counts()
# frequency of each value!

Name
Krishna    2
Irfan      2
upgrad     1
Name: count, dtype: int64